MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m252/thirdparty/m252/psio_reg.h
/**************************************************************************//**
 * @file     psio_reg.h
 * @version  V1.00
 * @brief    PSIO register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __PSIO_REG_H__
#define __PSIO_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup PSIO Programable Serial IO (PSIO)
    Memory Mapped Structure for PSIO Controller
    @{
*/

typedef struct
{
    /**
    * @var SCCT_T::SCCTL
     * Offset: 0x20  PSIO Slot Controller n Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |INISLOT   |Initial Slot Period
     * |        |          |The initial slot of the repeat period
     * |        |          |0000 = No use.
     * |        |          |0001 = SLOT0.
     * |        |          |0010 = SLOT1.
     * |        |          |0011 = SLOT2.
     * |        |          |0100 = SLOT3.
     * |        |          |0101 = SLOT4.
     * |        |          |0110 = SLOT5.
     * |        |          |0111 = SLOT6.
     * |        |          |1000 = SLOT7.
     * |[7:4]   |ENDSLOT   |End Slot Period
     * |        |          |The end slot of the repeat period
     * |        |          |0000 = No use.
     * |        |          |0001 = SLOT0.
     * |        |          |0010 = SLOT1.
     * |        |          |0011 = SLOT2.
     * |        |          |0100 = SLOT3.
     * |        |          |0101 = SLOT4.
     * |        |          |0110 = SLOT5.
     * |        |          |0111 = SLOT6.
     * |        |          |1000 = SLOT7.
     * |[13:8]  |SPLCNT    |Slot Period Loop Count
     * |        |          |000000 ~ 111110: loop count
     * |        |          |000000 = slot period loop count function is disable.
     * |        |          |000001= repeat selection loop once, which means total go through selected repeat slots 2 times.
     * |        |          |111111 = loop until stop PSIO slot controller.
     * |        |          |Note1: If setting this register 111111 with PDMA mode and OUTPUT mode, it will stop automatically when PDMA is finish and output data in shift register is finished.
     * |        |          |Note2: If setting this register 111111 with PDMA mode and INPUT mode, it will stop automatically when pdma is finish.
     * |        |          |Note3: If PSIO receives stop instruction during repeat mode, it will stop only when the current loop is finished.
     * |[15:14] |TRIGSRC   |PSIO_TMRxPSIO_SCn Trigger Source
     * |        |          |00 = Trigger by software.
     * |        |          |01 = Trigger PSIO_TMRxPSIO_SCn when related PSIO_PIN occurred falling edge.
     * |        |          |02 = Trigger PSIO_TMRxPSIO_SCn when related PSIO_PIN occurred rising edge.
     * |        |          |03 = Trigger PSIO_TMRxPSIO_SCn when related PSIO_PIN occurred rising edge or falling edge.
     * |        |          |Note1: PSIO slot controller pin can only be trigger by related pins which is setting from PSIOn_GENCTL[25:24] SC_SEL.
     * |        |          |Note2: Configuring rising or falling signal trigger PSIO, the signal need to hold for at least two PSIO_CLK for de-bounce or PSIO will not be triggered.
     * |[16]    |START     |PSIO_TMRxPSIO_SCn Start
     * |        |          |0 = Stop PSIO_TMRxPSIO_SCn.
     * |        |          |1 = Start PSIO_TMRxPSIO_SCn to count and active related PSIO_PIN.
     * |        |          |Note: this bit is always read as 0.
     * |[17]    |REPEAT    |Whole Repeat Mode
     * |        |          |Slot controller repeats counting forever. It can stop by clear START bit.
     * |        |          |0 = Repeat mode disabled.
     * |        |          |1 = Repeat mode enabled.
     * |        |          |Note1: If this bit is enabled with PDMA mode, slot controller will stop automatically when the PDMA finish transferring number of data.
     * |        |          |Note2: If PSIO receives stop instruction during repeat mode, it will stop only when the current loop is finished.
     * |[24]    |BUSY      |PSIO_TMRxPSIO_SCn Busy Flag
     * |        |          |0 = PSIO_TMRxPSIO_SCn is not busy.
     * |        |          |1 = PSIO_TMRxPSIO_SCn is busy.
     * |        |          |Note: This bit will be set to 1 when slot controller start to count automatically and it will be cleared to 0 automatically when slot controller stop counting, too
     * |[25]    |IDLE      |PSIO_TMRxPSIO_SCn Idle Flag
     * |        |          |0 = PSIO_TMRxPSIO_SCn is not IDLE.
     * |        |          |1 = PSIO_TMRxPSIO_SCn is IDLE.
     * |        |          |Note1: This bit will be cleared to 0 when slot controller start to count automatically.
     * |        |          |Note2: This bit will be set to 1 when configuring it 1 by software.
     * |        |          |Note3: This bit is set to distinguish INTERVAL_OUTPUT(PSIOn_GENCTL[5:4]) and INITIAL_OUTPUT(PSIOn_GENCTL[3:2]).
     * @var SCCT_T::SCSLOT
     * Offset: 0x24  PSIO Slot Controller n Slot Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |SLOT0     |PSIO Slot Controller Slot0 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[7:4]   |SLOT1     |PSIO Slot Controller Slot1 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[11:8]  |SLOT2     |PSIO Slot Controller Slot2 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[15:12] |SLOT3     |PSIO Slot Controller Slot3 Tick Count
     * |        |          |0 to 15.
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[19:16] |SLOT4     |PSIO Slot Controller Slot4 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[23:20] |SLOT5     |PSIO Slot Controller Slot5 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[27:24] |SLOT6     |PSIO Slot Controller Slot6 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     * |[31:28] |SLOT7     |PSIO Slot Controller Slot7 Tick Count
     * |        |          |0 to 15
     * |        |          |Note1: Filling in all 0 to this field indicates to disable this slot.
     * |        |          |Note2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.
     * |        |          |Note3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.
     */
    __IO uint32_t SCCTL;                 /*!< PSIO Slot Counter n Control register                                     */
    __IO uint32_t SCSLOT;                /*!< PSIO Slot Counter n Slot Register                                        */

} SCCT_T;

