MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m252/thirdparty/m252/psio_reg.h
     * |        |          |Note3: This bit can be cleared by configure 1 to it.
     * |        |          |Note4: This bit will be cleared automatically when related slot controller start and pin enabled.
     * @var PSIO_T::ISSTS
     * Offset: 0x10  PSIO Input Status State Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |VALID0    |Input Status Valid 0
     * |        |          |0 = The pin 0 input Status is not ready.
     * |        |          |1 = The pin 0 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[1]     |INSTSOV0  |Input Status Overflow 0
     * |        |          |0 = The pin 0 input Status does not overflow.
     * |        |          |1 = The pin 0 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[2]     |VALID1    |Input Status Valid 1
     * |        |          |0 = The pin 1 input Status is not ready.
     * |        |          |1 = The pin 1 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[3]     |INSTSOV1  |Input Status Overflow 1
     * |        |          |0 = The pin 1 input Status does not overflow.
     * |        |          |1 = The pin 1 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[4]     |VALID2    |Input Status Valid 2
     * |        |          |0 = The pin 2 input Status is not ready.
     * |        |          |1 = The pin 2 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[5]     |INSTSOV2  |Input Status Overflow 2
     * |        |          |0 = The pin 2 input Status does not overflow.
     * |        |          |1 = The pin 2 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[6]     |VALID3    |Input Status Valid 3
     * |        |          |0 = The pin 3 input Status is not ready.
     * |        |          |1 = The pin 3 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[7]     |INSTSOV3  |Input Status Overflow 3
     * |        |          |0 = The pin 3 input Status does not overflow.
     * |        |          |1 = The pin 3 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[8]     |VALID4    |Input Status Valid 4
     * |        |          |0 = The pin 4 input Status is not ready.
     * |        |          |1 = The pin 4 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[9]     |INSTSOV4  |Input Status Overflow 4
     * |        |          |0 = The pin 4 input Status does not overflow.
     * |        |          |1 = The pin 4 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[10]    |VALID5    |Input Status Valid 5
     * |        |          |0 = The pin 5 input Status is not ready.
     * |        |          |1 = The pin 5 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[11]    |INSTSOV5  |Input Status Overflow 5
     * |        |          |0 = The pin 5 input Status does not overflow.
     * |        |          |1 = The pin 5 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[12]    |VALID6    |Input Status Valid 6
     * |        |          |0 = The pin 6 input Status is not ready.
     * |        |          |1 = The pin 6 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[13]    |INSTSOV6  |Input Status Overflow 6
     * |        |          |0 = The pin 6 input Status does not overflow.
     * |        |          |1 = The pin 6 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * |[14]    |VALID7    |Input Status Valid 7
     * |        |          |0 = The pin7 input Status is not ready.
     * |        |          |1 = The pin7 input Status is ready.
     * |        |          |Note: This valid bit will be cleared automatically if PSIOn_INSTS is read.
     * |[15]    |INSTSOV7  |Input Status Overflow 7
     * |        |          |0 = The pin7 input Status does not overflow.
     * |        |          |1 = The pin7 input Status occur overflow.
     * |        |          |Note: This overflow bit can be write 1 clear..
     * @var PSIO_T::PDMACTL
     * Offset: 0x14  PSIO PDMA Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OPIN0EN   |Output PDMA Pin0 Enable Bit
     * |        |          |0 = Pin0 output PDMA function Disabled.
     * |        |          |1 = Pin0 output PDMA function Enabled.
     * |[1]     |OPIN1EN   |Output PDMA Pin1 Enable Bit
     * |        |          |0 = Pin1 output PDMA function Disabled.
     * |        |          |1 = Pin1 output PDMA function Enabled.
     * |[2]     |OPIN2EN   |Output PDMA Pin2 Enable Bit
     * |        |          |0 = Pin2 output PDMA function Disabled.
     * |        |          |1 = Pin2 output PDMA function Enabled.
     * |[3]     |OPIN3EN   |Output PDMA Pin3 Enable Bit
     * |        |          |0 = Pin3 output PDMA function Disabled.
     * |        |          |1 = Pin3 output PDMA function Enabled.
     * |[4]     |OPIN4EN   |Output PDMA Pin4 Enable Bit
     * |        |          |0 = Pin4 output PDMA function Disabled.
     * |        |          |1 = Pin4 output PDMA function Enabled.
     * |[5]     |OPIN5EN   |Output PDMA Pin5 Enable Bit
     * |        |          |0 = Pin5 output PDMA function Disabled.
     * |        |          |1 = Pin5 output PDMA function Enabled.
     * |[6]     |OPIN6EN   |Output PDMA Pin6 Enable Bit
     * |        |          |0 = Pin6 output PDMA function Disabled.
     * |        |          |1 = Pin6 output PDMA function Enabled.
     * |[7]     |OPIN7EN   |Output PDMA Pin7 Enable Bit
     * |        |          |0 = Pin7 output PDMA function Disabled.
     * |        |          |1 = Pin7 output PDMA function Enabled.
     * |[8]     |IPIN0EN   |Input PDMA Pin0 Enable Bit
     * |        |          |0 = Pin0 input PDMA function Disabled.
     * |        |          |1 = Pin0 input PDMA function Enabled.
     * |[9]     |IPIN1EN   |Input PDMA Pin1 Enable Bit
     * |        |          |0 = Pin1 input PDMA function Disabled.
     * |        |          |1 = Pin1 input PDMA function Enabled.
     * |[10]    |IPIN2EN   |Input PDMA Pin2 Enable Bit
     * |        |          |0 = Pin2 input PDMA function Disabled.
     * |        |          |1 = Pin2 input PDMA function Enabled.
     * |[11]    |IPIN3EN   |Input PDMA Pin3 Enable Bit
     * |        |          |0 = Pin3 input PDMA function Disabled.
     * |        |          |1 = Pin3 input PDMA function Enabled.
     * |[12]    |IPIN4EN   |Input PDMA Pin4 Enable Bit
     * |        |          |0 = Pin4 input PDMA function Disabled.
     * |        |          |1 = Pin4 input PDMA function Enabled.
     * |[13]    |IPIN5EN   |Input PDMA Pin5 Enable Bit
     * |        |          |0 = Pin5 input PDMA function Disabled.
     * |        |          |1 = Pin5 input PDMA function Enabled.
     * |[14]    |IPIN6EN   |Input PDMA Pin6 Enable Bit
     * |        |          |0 = Pin6 input PDMA function Disabled.
     * |        |          |1 = Pin6 input PDMA function Enabled.
     * |[15]    |IPIN7EN   |Input PDMA Pin7 Enable Bit
     * |        |          |0 = Pin7 input PDMA function Disabled.
     * |        |          |1 = Pin7 input PDMA function Enabled.
     * |[19:16] |OUTNUM    |PDMA Output Current Number (Read Only)
     * |        |          |0000 = PDMA IDLE.
     * |        |          |0001 = pin 0.
     * |        |          |0010 = pin 1.
     * |        |          |0011 = pin 2.
     * |        |          |0100 = pin 3.
     * |        |          |0101 = pin 4.
     * |        |          |0110 = pin 5.
     * |        |          |0111 = pin 6.
     * |        |          |1000 = pin 7.
     * |        |          |1001 = PDMA WAIT.
     * |        |          |Others = reserved.
     * |        |          |This register shows the current pin number of output register write by PDMA.
     * |[21:20] |OUTSCSEL  |PDMA Output Data Slot Controller Selection
     * |        |          |00: slot controller 0.
     * |        |          |01: slot controller 1.
     * |        |          |10: slot controller 2.
     * |        |          |11: slot controller 3.
     * |[27:24] |INNUM     |PDMA Input Current Number (Read Only)
     * |        |          |0000 = PDMA IDLE.
     * |        |          |0001 = pin 0.
     * |        |          |0010 = pin 1.
     * |        |          |0011 = pin 2.
     * |        |          |0100 = pin 3.
     * |        |          |0101 = pin 4.
     * |        |          |0110 = pin 5.
     * |        |          |0111 = pin 6.
     * |        |          |1000 = pin 7.
     * |        |          |1001 = PDMA WAIT.
     * |        |          |Others = reserved.
     * |        |          |This register shows the current pin number of input register read by PDMA.
     * |[29:28] |INSCSEL   |PDMA Input Data Slot Controller Selection
     * |        |          |00: slot controller 0.
     * |        |          |01: slot controller 1.
     * |        |          |10: slot controller 2.
     * |        |          |11: slot controller 3.
     * @var PSIO_T::PODAT
     * Offset: 0x18  PSIO PDMA Output Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |PDMAOUT   |PDMA Output Data
     * |        |          |This register is used for PSIO with PDMA single mode, and set PDMA with fixed address.
     * |        |          |When PSIO in PDMA mode, setting PDMA to write data to this register.
     * |        |          |The data in this register will be placed to corresponding PSIOn_OUTDATA register in order, when Output Data Empty Flag is 1 and PDMA mode enabled.
     * @var PSIO_T::PIDAT
     * Offset: 0x1C  PSIO PDMA Input Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |PDMAIN    |PDMA Input Data
     * |        |          |This register is used for PSIO with PDMA single mode, and set PDMA with fixed address.
     * |        |          |When PSIO in PDMA mode, setting PDMA to read data from this register.
     * |        |          |The data in this register will be up2025-08-12d from corresponding PSIOn_INDATA register in order, when Input Data Full Flag is 1 and PDMA mode enable.
     */
    __IO uint32_t INTCTL;                /*!< [0x0000] PSIO Interrupt Control Register                                  */
    __IO uint32_t INTEN;                 /*!< [0x0004] PSIO Interrupt Enable Register                                   */
    __IO uint32_t INTSTS;                /*!< [0x0008] PSIO Interrupt Status Register                                   */
    __IO uint32_t TRANSTS;               /*!< [0x000c] PSIO Transfer Status Register                                    */
    __IO uint32_t ISSTS;                 /*!< [0x0010] PSIO Input Status State Register                                 */
    __IO uint32_t PDMACTL;               /*!< [0x0014] PSIO PDMA Control Register                                       */
    __O  uint32_t PODAT;                 /*!< [0x0018] PSIO PDMA Output Data Register                                   */
    __IO uint32_t PIDAT;                 /*!< [0x001c] PSIO PDMA Input Data Register                                    */
    SCCT_T        SCCT[4];               /*!< [0x0020 ~ 0x0048] PSIO Slot Controller Registers                          */
    GNCT_T        GNCT[8];               /*!< [0x0040 ~ 0x0138] PSIO Control Registers                                  */
} PSIO_T;

/**
    @addtogroup PSIO_CONST PSIO Bit Field Definition
    Constant Definitions for PSIO Controller
@{ */

