MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m252/thirdparty/m252/psio_reg.h
#define PSIO_TRANSTS_OUTUF1_Pos          (7)                                               /*!< PSIO_T::TRANSTS: OUTUF1 Position       */
#define PSIO_TRANSTS_OUTUF1_Msk          (0x1ul << PSIO_TRANSTS_OUTUF1_Pos)                /*!< PSIO_T::TRANSTS: OUTUF1 Mask           */

#define PSIO_TRANSTS_INFULL2_Pos         (8)                                               /*!< PSIO_T::TRANSTS: INFULL2 Position      */
#define PSIO_TRANSTS_INFULL2_Msk         (0x1ul << PSIO_TRANSTS_INFULL2_Pos)               /*!< PSIO_T::TRANSTS: INFULL2 Mask          */

#define PSIO_TRANSTS_INOVER2_Pos         (9)                                               /*!< PSIO_T::TRANSTS: INOVER2 Position      */
#define PSIO_TRANSTS_INOVER2_Msk         (0x1ul << PSIO_TRANSTS_INOVER2_Pos)               /*!< PSIO_T::TRANSTS: INOVER2 Mask          */

#define PSIO_TRANSTS_OUTEPY2_Pos         (10)                                              /*!< PSIO_T::TRANSTS: OUTEPY2 Position      */
#define PSIO_TRANSTS_OUTEPY2_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY2_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY2 Mask          */

#define PSIO_TRANSTS_OUTUF2_Pos          (11)                                              /*!< PSIO_T::TRANSTS: OUTUF2 Position       */
#define PSIO_TRANSTS_OUTUF2_Msk          (0x1ul << PSIO_TRANSTS_OUTUF2_Pos)                /*!< PSIO_T::TRANSTS: OUTUF2 Mask           */

#define PSIO_TRANSTS_INFULL3_Pos         (12)                                              /*!< PSIO_T::TRANSTS: INFULL3 Position      */
#define PSIO_TRANSTS_INFULL3_Msk         (0x1ul << PSIO_TRANSTS_INFULL3_Pos)               /*!< PSIO_T::TRANSTS: INFULL3 Mask          */

#define PSIO_TRANSTS_INOVER3_Pos         (13)                                              /*!< PSIO_T::TRANSTS: INOVER3 Position      */
#define PSIO_TRANSTS_INOVER3_Msk         (0x1ul << PSIO_TRANSTS_INOVER3_Pos)               /*!< PSIO_T::TRANSTS: INOVER3 Mask          */

#define PSIO_TRANSTS_OUTEPY3_Pos         (14)                                              /*!< PSIO_T::TRANSTS: OUTEPY3 Position      */
#define PSIO_TRANSTS_OUTEPY3_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY3_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY3 Mask          */

#define PSIO_TRANSTS_OUTUF3_Pos          (15)                                              /*!< PSIO_T::TRANSTS: OUTUF3 Position       */
#define PSIO_TRANSTS_OUTUF3_Msk          (0x1ul << PSIO_TRANSTS_OUTUF3_Pos)                /*!< PSIO_T::TRANSTS: OUTUF3 Mask           */

#define PSIO_TRANSTS_INFULL4_Pos         (16)                                              /*!< PSIO_T::TRANSTS: INFULL4 Position      */
#define PSIO_TRANSTS_INFULL4_Msk         (0x1ul << PSIO_TRANSTS_INFULL4_Pos)               /*!< PSIO_T::TRANSTS: INFULL4 Mask          */

#define PSIO_TRANSTS_INOVER4_Pos         (17)                                              /*!< PSIO_T::TRANSTS: INOVER4 Position      */
#define PSIO_TRANSTS_INOVER4_Msk         (0x1ul << PSIO_TRANSTS_INOVER4_Pos)               /*!< PSIO_T::TRANSTS: INOVER4 Mask          */

#define PSIO_TRANSTS_OUTEPY4_Pos         (18)                                              /*!< PSIO_T::TRANSTS: OUTEPY4 Position      */
#define PSIO_TRANSTS_OUTEPY4_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY4_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY4 Mask          */

#define PSIO_TRANSTS_OUTUF4_Pos          (19)                                              /*!< PSIO_T::TRANSTS: OUTUF4 Position       */
#define PSIO_TRANSTS_OUTUF4_Msk          (0x1ul << PSIO_TRANSTS_OUTUF4_Pos)                /*!< PSIO_T::TRANSTS: OUTUF4 Mask           */

#define PSIO_TRANSTS_INFULL5_Pos         (20)                                              /*!< PSIO_T::TRANSTS: INFULL5 Position      */
#define PSIO_TRANSTS_INFULL5_Msk         (0x1ul << PSIO_TRANSTS_INFULL5_Pos)               /*!< PSIO_T::TRANSTS: INFULL5 Mask          */

#define PSIO_TRANSTS_INOVER5_Pos         (21)                                              /*!< PSIO_T::TRANSTS: INOVER5 Position      */
#define PSIO_TRANSTS_INOVER5_Msk         (0x1ul << PSIO_TRANSTS_INOVER5_Pos)               /*!< PSIO_T::TRANSTS: INOVER5 Mask          */

#define PSIO_TRANSTS_OUTEPY5_Pos         (22)                                              /*!< PSIO_T::TRANSTS: OUTEPY5 Position      */
#define PSIO_TRANSTS_OUTEPY5_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY5_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY5 Mask          */

#define PSIO_TRANSTS_OUTUF5_Pos          (23)                                              /*!< PSIO_T::TRANSTS: OUTUF5 Position       */
#define PSIO_TRANSTS_OUTUF5_Msk          (0x1ul << PSIO_TRANSTS_OUTUF5_Pos)                /*!< PSIO_T::TRANSTS: OUTUF5 Mask           */

#define PSIO_TRANSTS_INFULL6_Pos         (24)                                              /*!< PSIO_T::TRANSTS: INFULL6 Position      */
#define PSIO_TRANSTS_INFULL6_Msk         (0x1ul << PSIO_TRANSTS_INFULL6_Pos)               /*!< PSIO_T::TRANSTS: INFULL6 Mask          */

#define PSIO_TRANSTS_INOVER6_Pos         (25)                                              /*!< PSIO_T::TRANSTS: INOVER6 Position      */
#define PSIO_TRANSTS_INOVER6_Msk         (0x1ul << PSIO_TRANSTS_INOVER6_Pos)               /*!< PSIO_T::TRANSTS: INOVER6 Mask          */

#define PSIO_TRANSTS_OUTEPY6_Pos         (26)                                              /*!< PSIO_T::TRANSTS: OUTEPY6 Position      */
#define PSIO_TRANSTS_OUTEPY6_Msk         (0x1ul << PSIO_TRANSTS_OUTEPY6_Pos)               /*!< PSIO_T::TRANSTS: OUTEPY6 Mask          */

#define PSIO_TRANSTS_OUTUF6_Pos          (27)                                              /*!< PSIO_T::TRANSTS: OUTUF6 Position       */
#define PSIO_TRANSTS_OUTUF6_Msk          (0x1ul << PSIO_TRANSTS_OUTUF6_Pos)                /*!< PSIO_T::TRANSTS: OUTUF6 Mask           */

#define PSIO_TRANSTS_INFULL7_Pos         (28)                                              /*!< PSIO_T::TRANSTS: INFULL7 Position      */
#define PSIO_TRANSTS_INFULL7_Msk         (0x1ul << PSIO_TRANSTS_INFULL7_Pos)               /*!< PSIO_T::TRANSTS: INFULL7 Mask          */

#define PSIO_TRANSTS_INOVER7_Pos         (29)                                              /*!< PSIO_T::TRANSTS: INOVER7 Position      */
#define PSIO_TRANSTS_INOVER7_Msk         (0x1ul << PSIO_TRANSTS_INOVER7_Pos)               /*!< PSIO_T::TRANSTS: INOVER7 Mask          */

